import 'dart:typed_data';

const HeartBeat = 1;
const NormalData = 2;
const OriginalData = 3;

class INode {
  String metric = ""; // 分组统计 团组 坐席 关注 证件类别
  int quorum = 0; // 出席数量
  int attend = 0; // 实到数量
  int leave = 0; // 请假数量
  int absence = 0; // 实缺数量
}

class TNode {
  String slot = "";
  int num = 0;

  TNode(String slot, int num) {
    slot = slot;
    num = num;
  }
}

class DNode {
  String title = "";
  int step = 0;
  bool executed = false;
}



class MetricBoard {
  // 时间范围
  List<String> _timeSlots =  [
    '06:00', '06:05', '06:10', '06:15', '06:20', '06:25', '06:30', '06:35', '06:40', '06:45', '06:50', '06:55',
    '07:00', '07:05', '07:10', '07:15', '07:20', '07:25', '07:30', '07:35', '07:40', '07:45', '07:50', '07:55',
    '08:00', '08:05', '08:10', '08:15', '08:20', '08:25', '08:30', '08:35', '08:40', '08:45', '08:50', '08:55',
    '09:00', '09:05', '09:10', '09:15', '09:20', '09:25', '09:30', '09:35', '09:40', '09:45', '09:50', '09:55',
    '10:00', '10:05', '10:10', '10:15', '10:20', '10:25', '10:30', '10:35', '10:40', '10:45', '10:50', '10:55',
    '11:00', '11:05', '11:10', '11:15', '11:20', '11:25', '11:30', '11:35', '11:40', '11:45', '11:50', '11:55',
    '12:00', '12:05', '12:10', '12:15', '12:20', '12:25', '12:30', '12:35', '12:40', '12:45', '12:50', '12:55',
    '13:00', '13:05', '13:10', '13:15', '13:20', '13:25', '13:30', '13:35', '13:40', '13:45', '13:50', '13:55',
    '14:00', '14:05', '14:10', '14:15', '14:20', '14:25', '14:30', '14:35', '14:40', '14:45', '14:50', '14:55',
    '15:00', '15:05', '15:10', '15:15', '15:20', '15:25', '15:30', '15:35', '15:40', '15:45', '15:50', '15:55',
    '16:00', '16:05', '16:10', '16:15', '16:20', '16:25', '16:30', '16:35', '16:40', '16:45', '16:50', '16:55',
    '17:00', '17:05', '17:10', '17:15', '17:20', '17:25', '17:30', '17:35', '17:40', '17:45', '17:50', '17:55',
    '18:00'
  ];

  // 标题
  String title = "";
  String subTitle = "";

  // 出席数据概览 应到 实到 未到 请假
  Int32List Appeared = Int32List(4);

  // 列席数据概览 应到 实到 未到 请假
  Int32List Special = Int32List(4);

  // 出席详情
  Map<String, dynamic> AppearedDetail = {};

  // 列席详情
  Map<String, dynamic> SpecialDetail = {};

  // 流量统计
  List<TNode> Traffic = [];

  // 流程看板
  List<DNode> ProgressDiagram = [];

  // 分项 团组列表
  Map<String, Int32List> ItemGroup = {};

  // 分项 坐席
  Map<String, Int32List> ItemSeat = {};

  // 分项 关注人群
  Map<String, Int32List> ItemObserved = {};

  // 分项 - 证件类型
  Map<String, Int32List> ItemCard = {};

  // 设备路由图
  Map<String, dynamic> DeviceRouteMap = {};
}